; domain
(define (domain logistics-strips)
  (:requirements :strips :constraints)
  (:predicates 	(OBJ ?obj)
	       	(TRUCK ?truck)
               	(LOCATION ?loc)
		(AIRPLANE ?airplane)
                (CITY ?city)
                (AIRPORT ?airport)
		(at ?obj ?loc)
		(in ?obj1 ?obj2)
		(in-city ?obj ?city))
 
  ; (:types )		; default object

(:action LOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
   (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action LOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
   (at ?obj ?loc) (at ?airplane ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?airplane)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj
    ?truck
    ?loc)
  :precondition
   (and (OBJ ?obj) (TRUCK ?truck) (LOCATION ?loc)
        (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action UNLOAD-AIRPLANE
  :parameters
   (?obj
    ?airplane
    ?loc)
  :precondition
   (and (OBJ ?obj) (AIRPLANE ?airplane) (LOCATION ?loc)
        (in ?obj ?airplane) (at ?airplane ?loc))
  :effect
   (and (not (in ?obj ?airplane)) (at ?obj ?loc)))

(:action DRIVE-TRUCK
  :parameters
   (?truck
    ?loc-from
    ?loc-to
    ?city)
  :precondition
   (and (TRUCK ?truck) (LOCATION ?loc-from) (LOCATION ?loc-to) (CITY ?city)
   (at ?truck ?loc-from)
   (in-city ?loc-from ?city)
   (in-city ?loc-to ?city))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action FLY-AIRPLANE
  :parameters
   (?airplane
    ?loc-from
    ?loc-to)
  :precondition
   (and (AIRPLANE ?airplane) (AIRPORT ?loc-from) (AIRPORT ?loc-to)
	(at ?airplane ?loc-from))
  :effect
   (and (not (at ?airplane ?loc-from)) (at ?airplane ?loc-to)))
)

; problem
(define (problem logistics-c5-s2-p10-a5)
(:domain logistics-strips)
(:objects a0 a1 a2 a3 a4 
          c0 c1 c2 c3 c4 
          t0 t1 t2 t3 t4 
          l0-0 l0-1 l1-0 l1-1 l2-0 l2-1 l3-0 l3-1 l4-0 l4-1 
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
)
(:init
    (AIRPLANE a0)
    (AIRPLANE a1)
    (AIRPLANE a2)
    (AIRPLANE a3)
    (AIRPLANE a4)
    (CITY c0)
    (CITY c1)
    (CITY c2)
    (CITY c3)
    (CITY c4)
    (TRUCK t0)
    (TRUCK t1)
    (TRUCK t2)
    (TRUCK t3)
    (TRUCK t4)
    (LOCATION l0-0)
    (in-city  l0-0 c0)
    (LOCATION l0-1)
    (in-city  l0-1 c0)
    (LOCATION l1-0)
    (in-city  l1-0 c1)
    (LOCATION l1-1)
    (in-city  l1-1 c1)
    (LOCATION l2-0)
    (in-city  l2-0 c2)
    (LOCATION l2-1)
    (in-city  l2-1 c2)
    (LOCATION l3-0)
    (in-city  l3-0 c3)
    (LOCATION l3-1)
    (in-city  l3-1 c3)
    (LOCATION l4-0)
    (in-city  l4-0 c4)
    (LOCATION l4-1)
    (in-city  l4-1 c4)
    (AIRPORT l0-0)
    (AIRPORT l1-0)
    (AIRPORT l2-0)
    (AIRPORT l3-0)
    (AIRPORT l4-0)
    (OBJ p0)
    (OBJ p1)
    (OBJ p2)
    (OBJ p3)
    (OBJ p4)
    (OBJ p5)
    (OBJ p6)
    (OBJ p7)
    (OBJ p8)
    (OBJ p9)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l2-0)
    (at t3 l3-0)
    (at t4 l4-1)
    (at p0 l4-1)
    (at p1 l1-1)
    (at p2 l0-1)
    (at p3 l3-0)
    (at p4 l1-1)
    (at p5 l0-1)
    (at p6 l2-0)
    (at p7 l4-1)
    (at p8 l3-0)
    (at p9 l1-1)
    (at a0 l0-0)
    (at a1 l3-0)
    (at a2 l2-0)
    (at a3 l2-0)
    (at a4 l3-0)
)
(:goal
    (and
        (at p0 l3-0)
        (at p1 l1-0)
        (at p2 l1-0)
        (at p3 l3-0)
        (at p4 l2-1)
        (at p5 l4-0)
        (at p6 l0-1)
        (at p7 l3-0)
        (at p8 l0-1)
        (at p9 l1-0)
    )
)

  (:constraints
    (and
      (always (not (in p1 a0)))
      (always (not (in p1 a1)))
      (always (not (in p1 a2)))
      (always (not (in p1 a3)))
      (always (not (in p1 a4)))
      (always (not (in p3 a0)))
      (always (not (in p3 a1)))
      (always (not (in p3 a2)))
      (always (not (in p3 a3)))
      (always (not (in p3 a4)))
      (always (not (in p9 a0)))
      (always (not (in p9 a1)))
      (always (not (in p9 a2)))
      (always (not (in p9 a3)))
      (always (not (in p9 a4)))
    )
  )
)

; plan
1. (load-airplane p6 a2 l2-0)
   deleted: (at p6 l2-0)
   added: (in p6 a2)
   goals met: 1 of 10
2. (load-airplane p8 a1 l3-0)
   deleted: (at p8 l3-0)
   added: (in p8 a1)
   goals met: 1 of 10
3. (load-truck p7 t4 l4-1)
   deleted: (at p7 l4-1)
   added: (in p7 t4)
   goals met: 1 of 10
4. (load-truck p0 t4 l4-1)
   deleted: (at p0 l4-1)
   added: (in p0 t4)
   goals met: 1 of 10
5. (fly-airplane a0 l0-0 l4-0)
   deleted: (at a0 l0-0)
   added: (at a0 l4-0)
   goals met: 1 of 10
6. (drive-truck t1 l1-0 l1-1 c1)
   deleted: (at t1 l1-0)
   added: (at t1 l1-1)
   goals met: 1 of 10
7. (fly-airplane a3 l2-0 l1-0)
   deleted: (at a3 l2-0)
   added: (at a3 l1-0)
   goals met: 1 of 10
8. (fly-airplane a2 l2-0 l0-0)
   deleted: (at a2 l2-0)
   added: (at a2 l0-0)
   goals met: 1 of 10
9. (fly-airplane a1 l3-0 l0-0)
   deleted: (at a1 l3-0)
   added: (at a1 l0-0)
   goals met: 1 of 10
10. (drive-truck t4 l4-1 l4-0 c4)
   deleted: (at t4 l4-1)
   added: (at t4 l4-0)
   goals met: 1 of 10
11. (load-truck p9 t1 l1-1)
   deleted: (at p9 l1-1)
   added: (in p9 t1)
   goals met: 1 of 10
12. (load-truck p4 t1 l1-1)
   deleted: (at p4 l1-1)
   added: (in p4 t1)
   goals met: 1 of 10
13. (load-truck p1 t1 l1-1)
   deleted: (at p1 l1-1)
   added: (in p1 t1)
   goals met: 1 of 10
14. (unload-truck p7 t4 l4-0)
   deleted: (in p7 t4)
   added: (at p7 l4-0)
   goals met: 1 of 10
15. (unload-truck p0 t4 l4-0)
   deleted: (in p0 t4)
   added: (at p0 l4-0)
   goals met: 1 of 10
16. (unload-airplane p8 a1 l0-0)
   deleted: (in p8 a1)
   added: (at p8 l0-0)
   goals met: 1 of 10
17. (unload-airplane p6 a2 l0-0)
   deleted: (in p6 a2)
   added: (at p6 l0-0)
   goals met: 1 of 10
18. (drive-truck t1 l1-1 l1-0 c1)
   deleted: (at t1 l1-1)
   added: (at t1 l1-0)
   goals met: 1 of 10
19. (load-truck p8 t0 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 t0)
   goals met: 1 of 10
20. (load-truck p6 t0 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 t0)
   goals met: 1 of 10
21. (load-airplane p7 a0 l4-0)
   deleted: (at p7 l4-0)
   added: (in p7 a0)
   goals met: 1 of 10
22. (load-airplane p0 a0 l4-0)
   deleted: (at p0 l4-0)
   added: (in p0 a0)
   goals met: 1 of 10
23. (unload-truck p9 t1 l1-0)
   deleted: (in p9 t1)
   added: (at p9 l1-0)
   goals met: 2 of 10
24. (unload-truck p4 t1 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 2 of 10
25. (unload-truck p1 t1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 3 of 10
26. (fly-airplane a0 l4-0 l3-0)
   deleted: (at a0 l4-0)
   added: (at a0 l3-0)
   goals met: 3 of 10
27. (drive-truck t0 l0-0 l0-1 c0)
   deleted: (at t0 l0-0)
   added: (at t0 l0-1)
   goals met: 3 of 10
28. (load-airplane p4 a3 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 a3)
   goals met: 3 of 10
29. (unload-airplane p7 a0 l3-0)
   deleted: (in p7 a0)
   added: (at p7 l3-0)
   goals met: 4 of 10
30. (unload-airplane p0 a0 l3-0)
   deleted: (in p0 a0)
   added: (at p0 l3-0)
   goals met: 5 of 10
31. (unload-truck p8 t0 l0-1)
   deleted: (in p8 t0)
   added: (at p8 l0-1)
   goals met: 6 of 10
32. (unload-truck p6 t0 l0-1)
   deleted: (in p6 t0)
   added: (at p6 l0-1)
   goals met: 7 of 10
33. (load-truck p5 t0 l0-1)
   deleted: (at p5 l0-1)
   added: (in p5 t0)
   goals met: 7 of 10
34. (load-truck p2 t0 l0-1)
   deleted: (at p2 l0-1)
   added: (in p2 t0)
   goals met: 7 of 10
35. (fly-airplane a3 l1-0 l2-0)
   deleted: (at a3 l1-0)
   added: (at a3 l2-0)
   goals met: 7 of 10
36. (fly-airplane a0 l3-0 l4-0)
   deleted: (at a0 l3-0)
   added: (at a0 l4-0)
   goals met: 7 of 10
37. (drive-truck t0 l0-1 l0-0 c0)
   deleted: (at t0 l0-1)
   added: (at t0 l0-0)
   goals met: 7 of 10
38. (unload-airplane p4 a3 l2-0)
   deleted: (in p4 a3)
   added: (at p4 l2-0)
   goals met: 7 of 10
39. (unload-truck p5 t0 l0-0)
   deleted: (in p5 t0)
   added: (at p5 l0-0)
   goals met: 7 of 10
40. (unload-truck p2 t0 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 7 of 10
41. (load-truck p4 t2 l2-0)
   deleted: (at p4 l2-0)
   added: (in p4 t2)
   goals met: 7 of 10
42. (load-airplane p5 a1 l0-0)
   deleted: (at p5 l0-0)
   added: (in p5 a1)
   goals met: 7 of 10
43. (load-airplane p2 a2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a2)
   goals met: 7 of 10
44. (drive-truck t2 l2-0 l2-1 c2)
   deleted: (at t2 l2-0)
   added: (at t2 l2-1)
   goals met: 7 of 10
45. (fly-airplane a1 l0-0 l4-0)
   deleted: (at a1 l0-0)
   added: (at a1 l4-0)
   goals met: 7 of 10
46. (fly-airplane a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 7 of 10
47. (unload-truck p4 t2 l2-1)
   deleted: (in p4 t2)
   added: (at p4 l2-1)
   goals met: 8 of 10
48. (unload-airplane p5 a1 l4-0)
   deleted: (in p5 a1)
   added: (at p5 l4-0)
   goals met: 9 of 10
49. (unload-airplane p2 a2 l1-0)
   deleted: (in p2 a2)
   added: (at p2 l1-0)
   goals met: 10 of 10
